


def 计算期望伤害(暴击率, 暴击效果):
    return ((1000-暴击率)*1000+暴击率*暴击效果)/1000000




祸源 = None
无双 = None


无尽 = False
宗师 = False

暴击效果 = 2000
暴击率 = 0

l = "{:^10}{:^10}{:^10}{:^10}{:^10}"


for 无尽 in (True, False):
    for 宗师 in (True, False):
        暴击效果 = 2000
        暴击率 = 0
        if 无尽:
            暴击率 += 200
            暴击效果 += 500
        if 宗师:
            暴击率 += 200
        print("无尽" if 无尽 else '', "宗师" if 宗师 else '')
        print(l.format("无双", "祸源", "暴击率", "暴击效果", "伤害"))
        for i in range(11):

            无双 = i
            祸源 = 10 - i
            
            
            伤害期望 = 计算期望伤害(暴击率+16*祸源+7*无双, 暴击效果+36*无双)

            print(l.format(无双, 祸源, (暴击率+16*祸源+7*无双)/1000, (暴击效果+36*无双)/1000, 伤害期望))

            # print(l.format(无尽, 宗师, 无双, 祸源, int(暴击率*100), int(暴击效果*100), float(int(伤害期望*100))/100) )
        print()
        print()
